// العد التنازلي بثلاثة

// قُم بكتابة دالة تستقبل عدد صحيح integer. تقوم هذه الدالة بالعد التنازلي من ذلك العدد بثلاث أرقام وصولاً إلى الصفر، ومن ثم إرجاع مصفوفة من الأعداد الزوجية لذلك العد التنازلي مرتبة تصاعدياً. في حال كان العد التنازلي لا يحتوي على الأعداد (لأن الحد المُمر يساوي 3 أو أقل) سيتم إرجاع القيمة [0].

//Not Solved
function countdown(num) {
    var newArr = [];
    for (let i = num - 1; i >= 0; i -= 3) {
        if (num % 2 == 0) {
            newArr.push(num[i]);
        }
        else {
            newArr.push(0);
        }
    }
    return newArr;
}
